{
  "en": {
    "home.tagline": "AI-powered translations for modern apps",
    "home.description": "LocaleLens makes internationalization simple. Manage translations with AI assistance, integrate with any framework, and ship multilingual apps faster.",
    "home.cta": "Get Started",
    "home.try_dashboard": "Try Protected Route",
    "home.how_it_works": "How It Works",
    "home.step_1_title": "Add Your Keys",
    "home.step_1": "Define translation keys in your codebase. LocaleLens detects them automatically or you can add them manually.",
    "home.step_2_title": "Translate with AI",
    "home.step_2": "Use AI to generate translations or add them yourself. Review, edit, and approve with a simple workflow.",
    "home.step_3_title": "Fetch at Runtime",
    "home.step_3": "Your app fetches translations from the LocaleLens API. Updates are instant—no redeployment needed.",
    "home.missing_key_title": "Graceful Fallbacks",
    "home.missing_key_description": "When a translation key is missing, LocaleLens returns the key itself. This makes missing translations obvious during development and prevents runtime crashes:",
    "home.feature_server_title": "Server-Side Secure",
    "home.feature_server_desc": "API keys stay on the server. TanStack Start server functions keep your credentials safe while fetching translations.",
    "home.feature_realtime_title": "Real-Time Updates",
    "home.feature_realtime_desc": "Change translations in LocaleLens and see them live instantly. No build or deploy required.",
    "dashboard.title": "Protected Dashboard",
    "dashboard.logout": "Logout",
    "dashboard.description": "This is a protected route. You can only see this page because you're authenticated. Translations are loaded via SSR, just like the public route.",
    "dashboard.auth_status": "Auth status",
    "dashboard.authenticated": "Authenticated",
    "dashboard.translations_loaded": "Translations loaded",
    "dashboard.via_ssr": "Via SSR (no client fetch)",
    "dashboard.protected_note_title": "How This Works",
    "dashboard.protected_note": "This route uses beforeLoad to check authentication on the server. If not authenticated, you're redirected before the page renders. Translations are fetched in the root loader and shared across all routes."
  },
  "de": {
    "home.tagline": "KI-gestützte Übersetzungen für moderne Apps",
    "home.description": "LocaleLens macht Internationalisierung einfach. Übersetzungen mit KI-Unterstützung verwalten, in jedes Framework integrieren und mehrsprachige Apps schneller ausliefern.",
    "home.cta": "Loslegen",
    "home.try_dashboard": "Geschützte Route testen",
    "home.how_it_works": "So funktioniert's",
    "home.step_1_title": "Keys hinzufügen",
    "home.step_1": "Translation Keys im Code definieren. LocaleLens erkennt sie automatisch oder sie können manuell hinzugefügt werden.",
    "home.step_2_title": "Mit KI übersetzen",
    "home.step_2": "KI für Übersetzungen nutzen oder selbst hinzufügen. Prüfen, bearbeiten und freigeben mit einem einfachen Workflow.",
    "home.step_3_title": "Zur Laufzeit abrufen",
    "home.step_3": "Die App ruft Übersetzungen von der LocaleLens-API ab. Aktualisierungen sind sofort sichtbar—kein erneutes Deployment nötig.",
    "home.missing_key_title": "Elegante Fallbacks",
    "home.missing_key_description": "Fehlt ein Translation Key, gibt LocaleLens den Key selbst zurück. So werden fehlende Übersetzungen in der Entwicklung sofort sichtbar und Laufzeitfehler vermieden:",
    "home.feature_server_title": "Serverseitig sicher",
    "home.feature_server_desc": "API Keys bleiben auf dem Server. TanStack Start Server-Funktionen schützen Zugangsdaten beim Abrufen von Übersetzungen.",
    "home.feature_realtime_title": "Echtzeit-Updates",
    "home.feature_realtime_desc": "Übersetzungen in LocaleLens ändern und sofort live sehen. Kein Build oder Deployment erforderlich.",
    "dashboard.title": "Geschütztes Dashboard",
    "dashboard.logout": "Abmelden",
    "dashboard.description": "Dies ist eine geschützte Route. Diese Seite ist nur sichtbar, weil eine Authentifizierung vorliegt. Übersetzungen werden via SSR geladen, genau wie bei der öffentlichen Route.",
    "dashboard.auth_status": "Auth-Status",
    "dashboard.authenticated": "Authentifiziert",
    "dashboard.translations_loaded": "Übersetzungen geladen",
    "dashboard.via_ssr": "Via SSR (kein Client-Fetch)",
    "dashboard.protected_note_title": "So funktioniert es",
    "dashboard.protected_note": "Diese Route verwendet beforeLoad, um die Authentifizierung auf dem Server zu prüfen. Ohne Authentifizierung erfolgt eine Weiterleitung, bevor die Seite gerendert wird. Übersetzungen werden im Root-Loader abgerufen und mit allen Routen geteilt."
  },
  "es": {
    "home.tagline": "Traducciones impulsadas por IA para apps modernas",
    "home.description": "LocaleLens simplifica la internacionalización. Gestionar traducciones con asistencia de IA, integrar con cualquier framework y lanzar apps multilingües más rápido.",
    "home.cta": "Comenzar",
    "home.try_dashboard": "Probar ruta protegida",
    "home.how_it_works": "Cómo funciona",
    "home.step_1_title": "Agregar claves",
    "home.step_1": "Definir claves de traducción en el código. LocaleLens las detecta automáticamente o se pueden agregar manualmente.",
    "home.step_2_title": "Traducir con IA",
    "home.step_2": "Usar IA para generar traducciones o agregarlas manualmente. Revisar, editar y aprobar con un flujo simple.",
    "home.step_3_title": "Obtener en tiempo de ejecución",
    "home.step_3": "La app obtiene traducciones de la API de LocaleLens. Las actualizaciones son instantáneas—sin necesidad de redespliegue.",
    "home.missing_key_title": "Fallbacks elegantes",
    "home.missing_key_description": "Cuando falta una clave, LocaleLens devuelve la clave misma. Esto hace que las traducciones faltantes sean obvias durante el desarrollo y evita errores en tiempo de ejecución:",
    "home.feature_server_title": "Seguro del lado del servidor",
    "home.feature_server_desc": "Los API Keys permanecen en el servidor. Las server functions de TanStack Start protegen las credenciales al obtener traducciones.",
    "home.feature_realtime_title": "Actualizaciones en tiempo real",
    "home.feature_realtime_desc": "Cambiar traducciones en LocaleLens y verlas en vivo instantáneamente. Sin build ni deploy requerido.",
    "dashboard.title": "Dashboard protegido",
    "dashboard.logout": "Cerrar sesión",
    "dashboard.description": "Esta es una ruta protegida. Esta página solo es visible porque existe autenticación. Las traducciones se cargan vía SSR, igual que en la ruta pública.",
    "dashboard.auth_status": "Estado de auth",
    "dashboard.authenticated": "Autenticado",
    "dashboard.translations_loaded": "Traducciones cargadas",
    "dashboard.via_ssr": "Vía SSR (sin fetch en cliente)",
    "dashboard.protected_note_title": "Cómo funciona",
    "dashboard.protected_note": "Esta ruta usa beforeLoad para verificar autenticación en el servidor. Sin autenticación, se redirige antes de renderizar la página. Las traducciones se obtienen en el root loader y se comparten entre todas las rutas."
  }
}
